In [1]:
import pandas as pd
import numpy as np

In [2]:
labels=['w','x','y','z']
sample_list=[100,200,300,400]
array=np.array([1,2,3,4])
dict={'w':10,'x':20,'y':30,'z':40}

In [3]:
pd.Series(data=sample_list)

0    100
1    200
2    300
3    400
dtype: int64

In [4]:
pd.Series(data=sample_list,index=labels)

w    100
x    200
y    300
z    400
dtype: int64

In [5]:
pd.Series(data=sample_list,index=array)

1    100
2    200
3    300
4    400
dtype: int64

In [6]:
pd.Series(array,labels)

w    1
x    2
y    3
z    4
dtype: int32

In [7]:
pd.Series(dict)

w    10
x    20
y    30
z    40
dtype: int64

In [8]:
sports1=pd.Series([1,2,3,4],index=['cricket','football','basketball','golf'])
sports1

cricket       1
football      2
basketball    3
golf          4
dtype: int64

In [9]:
sports2=pd.Series([11,2,3,4],index=['cricket','football','baseball','golf'])
sports2

cricket     11
football     2
baseball     3
golf         4
dtype: int64

In [10]:
sports1+sports2

baseball       NaN
basketball     NaN
cricket       12.0
football       4.0
golf           8.0
dtype: float64

In [11]:
df1=pd.DataFrame(np.random.randn(8,5),index='A B C D E F G H'.split(),columns='Score1 Score2 Score3 Score4 Score5'.split())
df1

     Score1    Score2    Score3    Score4    Score5
A  0.154049  0.661608 -0.204129 -0.906592 -0.986704
B  1.362730 -0.661784 -0.916567 -2.152872  1.698478
C -0.689843  0.870661  0.176891  0.582027  0.707653
D  0.910240  1.788854  1.495183  0.452924 -0.873225
E -0.049133 -0.389253 -0.043095  0.400627  0.490070
F -0.751615  0.925098  0.252300 -0.881380 -0.079611
G -0.940338  1.856280 -1.066902  0.644456 -0.609508
H -1.215760 -0.009844 -1.265666 -0.929772 -0.264647

In [12]:
df1["Score1"]

A    0.154049
B    1.362730
C   -0.689843
D    0.910240
E   -0.049133
F   -0.751615
G   -0.940338
H   -1.215760
Name: Score1, dtype: float64

In [13]:
df1[["Score1","Score2"]]

     Score1    Score2
A  0.154049  0.661608
B  1.362730 -0.661784
C -0.689843  0.870661
D  0.910240  1.788854
E -0.049133 -0.389253
F -0.751615  0.925098
G -0.940338  1.856280
H -1.215760 -0.009844

In [14]:
df1['Score6']=df1['Score1']+df1['Score2']
df1

     Score1    Score2    Score3    Score4    Score5    Score6
A  0.154049  0.661608 -0.204129 -0.906592 -0.986704  0.815657
B  1.362730 -0.661784 -0.916567 -2.152872  1.698478  0.700946
C -0.689843  0.870661  0.176891  0.582027  0.707653  0.180818
D  0.910240  1.788854  1.495183  0.452924 -0.873225  2.699094
E -0.049133 -0.389253 -0.043095  0.400627  0.490070 -0.438386
F -0.751615  0.925098  0.252300 -0.881380 -0.079611  0.173483
G -0.940338  1.856280 -1.066902  0.644456 -0.609508  0.915942
H -1.215760 -0.009844 -1.265666 -0.929772 -0.264647 -1.225604

In [16]:
df2={'ID':['101','102','103','107','176'],'Name':['John','Mercy','Akash','Kavin','Lally'],'Profit':['20','54','56','87','123']}
df=pd.DataFrame(df2)
df

    ID   Name Profit
0  101   John     20
1  102  Mercy     54
2  103  Akash     56
3  107  Kavin     87
4  176  Lally    123

In [17]:
df["ID"]

0    101
1    102
2    103
3    107
4    176
Name: ID, dtype: object

In [19]:
df[["ID","Profit"]]

    ID Profit
0  101     20
1  102     54
2  103     56
3  107     87
4  176    123

In [20]:
df.drop("ID",axis=1)

    Name Profit
0   John     20
1  Mercy     54
2  Akash     56
3  Kavin     87
4  Lally    123

In [25]:
df.drop("Profit",axis=1)

    ID   Name
0  101   John
1  102  Mercy
2  103  Akash
3  107  Kavin
4  176  Lally

In [29]:
df.drop(1)

    ID   Name Profit
0  101   John     20
2  103  Akash     56
3  107  Kavin     87
4  176  Lally    123